class Product:
    """Класс пользователя описывает отдельно взятый товар и его характеристики
    :param: name: наименование товара
    :param: price: цена товара
    :param: rating: рейтинг товара по шкале от 1 до 10"""

    def __init__(self, name: str, price: int, rating: int):
        self._name = name
        self._price = price
        self.raring = rating


# Сделать clasmetod для возможности установки рейтинга пользователем
@classmethod


__Rating_dict = {
    "1": "1 звезда",
    "2": "2 звезды",
    "3": "3 звезды",
    "4": "4 звезды",
    "5": "5 звезд",
    "6": "6 звезд",
    "7": "7 звезд",
    "8": "8 звезд",
    "9": "9 звезд",
    "10": "10 звезд"}
